import React from 'react';
import './Blogs.css'
const Blogs = () => {
    return (
        <div>
            <h2>blog</h2>
                        <div className="container mt-5">
            <div className="row">

                <div className="col">
                    <h4 className='mb-2'>Difference between javascript and nodejs </h4>
                    <h6>javascript - </h6>
                    <p>১। জাভাস্ক্রিপ্ট হলো একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ  । <br />
                       ২। এটি প্রধানত ব্যবহার হয় ওয়েব আপ্লিকেশন এর ক্লাইন্ট সাইডে । <br />
                       ৩। জাভাস্ক্রিপ্ট স্পাইডার মাংকি , জাভাস্ক্রিপ্ট কোর , ভি এইট এইসব এঞ্জিনে চলতে পারে । </p>
                    <h6>Node js -</h6>
                    <p>১। নোড জে এস একটি ইন্টারপ্রেটেড ইনভাইরোনমেন্ট জাভাস্ক্রিপ্ট এর জন্য । <br />
                       ২। এটি প্রধানত ব্যবহার হয়  এর ব্যাকেন্ড সাইডে । <br />
                       ৩।  এটি শুধু ভি এইট এঞ্জিনে চলতে পারে । </p>
                </div>

                <div className="col">
                <h4 className='mb-2' >Differences between sql and nosql databases.</h4>
                <h6>SQL-</h6>
                <p>১।  এসকিউএল ডেটাবেসগুলিকে প্রাথমিকভাবে রিলেশনাল ডেটাবেস বলা হয়। <br />
                   ২। এসকিউএল ডাটাবেস হল টেবিল ভিত্তিক ডাটাবেস। <br />
                   ৩। এটি ব্যবহার করা হয় যখন ডেটা গোপন রাখা অত্যন্ত গুরুত্বপূর্ণ।  </p>
                   <h6>NOSQL-</h6>
                <p>১। নোএসকিউএল ডাটাবেসগুলিকে প্রাথমিকভাবে নন-রিলেশনাল  ডাটাবেস বলা হয়। <br />
                   ২। নোএসকিউএল ডাটাবেস হয়ে থাকে ডকুমেন্ট ভিত্তিক, কী-ভ্যালু পেয়ার, গ্রাফ ডাটাবেস । <br />
                   ৩। সঠিক ডেটার চেয়ে দ্রুত ডেটা থাকা বেশি গুরুত্বপূর্ণ হলে এটি ব্যবহার করা হয় ।</p>
                </div>

                <div className="col">
                <h4 className='mb-2'>When should you use nodejs and when should you use mongodb</h4>
                <h6>Nodejs-</h6>
                <p>নোড জেয়েস হল একটি জাভাস্ক্রিপ্ট ইঞ্জিন যা দিয়ে আপনি যেকোন অ্যাপ্লিকেশন কোড  করতে পারেন  জাভাস্ক্রিপ্ট দিয়ে প্রোগ্রামিং করে। এটি আপনার জাভাস্ক্রিপ্ট কোড চালায়। সাধারণত এটি এমন সার্ভার তৈরি করতে ব্যবহৃত হয় যা ওয়েব এর রিকুয়েস্টএ সাড়া দিতে পারে, যদিও এটি অনেক অন্যান্য ধরনের কোডের জন্যও ব্যবহার করা যেতে পারে। </p>

                <h6>Mongodb-</h6>
                    <p>মংগোডিবি একটি ডাটাবেস ইঞ্জিন। কিছু অ্যাপ্লিকেশন বা সার্ভারের মধ্যে কোড একটি ডাটাবেসে ডেটা সংরক্ষণ, অনুসন্ধান বা আপডেট করতে মংগোডিবি ব্যবহার করে। নোডে জেয়েস দিয়ে তৈরি অনেক ওয়েব সার্ভার আছে যেগুলো ডাটা সংরক্ষণের জন্য মংগোডিবি ব্যবহার করবে। </p>
                </div>

               
            </div>
            </div>
        </div>
    );
};

export default Blogs;